pvginkel/Intercom/sdkconfig.defaults
# Application configuration

# Device pins (push button, LEDs, I2S mic/speaker) are selected per hardware
# version in main/board_config.h via the HARDWARE_VERSION compile definition.

CONFIG_WIFI_MAX_TX_POWER=44

CONFIG_MQTT_USE_CORE_0=n
CONFIG_MQTT_USE_CORE_1=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_MAIN_TASK_STACK_SIZE=6144

CONFIG_IDF_TARGET="esp32s3"

# Setup flash

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# I2S

CONFIG_I2S_ENABLE_DEBUG_LOG=y

# SPIRAM

CONFIG_SPIRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# CPU speed and power management

CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# MQTT

CONFIG_MQTT_TOPIC_PREFIX="intercom/client"
CONFIG_MQTT_DEVICE_MANUFACTURER="Pieter"
CONFIG_MQTT_DEVICE_MODEL="Intercom"
# CONFIG_MQTT_DEVICE_MODEL_ID is set programmatically per hardware version in
# Application::get_device_configuration() ("Intercom v<HARDWARE_VERSION>").
